{
  "layers": [
    {
      "name": "conv1d_2",
      "class_name": "Conv1D",
      "output_shape": "None",
      "params": 832,
      "config": {
        "name": "conv1d_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          3
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "name": "max_pooling1d_1",
      "class_name": "MaxPooling1D",
      "output_shape": "None",
      "params": 0,
      "config": {
        "name": "max_pooling1d_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2
        ],
        "padding": "valid",
        "strides": [
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "name": "dropout_2",
      "class_name": "Dropout",
      "output_shape": "None",
      "params": 0,
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.3,
        "seed": null,
        "noise_shape": null
      }
    },
    {
      "name": "conv1d_3",
      "class_name": "Conv1D",
      "output_shape": "None",
      "params": 24704,
      "config": {
        "name": "conv1d_3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 128,
        "kernel_size": [
          3
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "name": "flatten_1",
      "class_name": "Flatten",
      "output_shape": "None",
      "params": 0,
      "config": {
        "name": "flatten_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      }
    },
    {
      "name": "dense_2",
      "class_name": "Dense",
      "output_shape": "None",
      "params": 24640,
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 64,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "name": "dropout_3",
      "class_name": "Dropout",
      "output_shape": "None",
      "params": 0,
      "config": {
        "name": "dropout_3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.3,
        "seed": null,
        "noise_shape": null
      }
    },
    {
      "name": "dense_3",
      "class_name": "Dense",
      "output_shape": "None",
      "params": 65,
      "config": {
        "name": "dense_3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 1,
        "activation": "sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    }
  ],
  "total_params": 50241,
  "trainable_params": 50241,
  "non_trainable_params": 0
}